{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 40], "dtype": "float32", "input_dim": 7061, "output_dim": 150, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 7061, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "dense_1/kernel", "shape": [256, 1000], "dtype": "float32", "quantization": {"min": -3.924272321252262, "scale": 0.030420715668622186, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1000], "dtype": "float32", "quantization": {"min": -0.5015404063112595, "scale": 0.0025458903873667995, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [1000, 7061], "dtype": "float32", "quantization": {"min": -13.589823451696656, "scale": 0.057829035964666625, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [7061], "dtype": "float32", "quantization": {"min": -7.62742765791276, "scale": 0.031259949417675244, "dtype": "uint8"}}, {"name": "embedding_1/embeddings", "shape": [7061, 150], "dtype": "float32", "quantization": {"min": -1.7839660069521734, "scale": 0.013618061121772317, "dtype": "uint8"}}, {"name": "lstm_1/kernel", "shape": [150, 1024], "dtype": "float32", "quantization": {"min": -2.089990708407234, "scale": 0.016201478359746, "dtype": "uint8"}}, {"name": "lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32", "quantization": {"min": -1.9133596925174488, "scale": 0.012109871471629422, "dtype": "uint8"}}, {"name": "lstm_1/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.46242331348213495, "scale": 0.007114204822802076, "dtype": "uint8"}}, {"name": "lstm_2/kernel", "shape": [256, 1024], "dtype": "float32", "quantization": {"min": -1.721336394665288, "scale": 0.013447940583322562, "dtype": "uint8"}}, {"name": "lstm_2/recurrent_kernel", "shape": [256, 1024], "dtype": "float32", "quantization": {"min": -1.0855450359045289, "scale": 0.008547598707909677, "dtype": "uint8"}}, {"name": "lstm_2/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.3831574894633948, "scale": 0.006494194736667708, "dtype": "uint8"}}]}]}